#!/usr/bin python
#-*- coding: utf-8 -*-
import os
'''题目：企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高于10万元，低于20万元时，低于10万元的部分按
10%提成，高于10万元的部分，可提成7.5%；20万到40万之间时，高于20万元的部分，可提成5%；40万到60万之间时高于40万元的部分，可提成
3%；60万到100万之间时，高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖
金总数？
程序分析：请利用数轴来分界，定位。注意定义时需把奖金定义成长整型'''
I = int(input('请输入当月利润：'))
def cal_bonus(i):
    if i <= 0:
        return 0
    elif 0 < i <= 100000:
        return i * 0.1
    elif 100000 < i <= 200000:
        return  100000 * 0.1 + (i - 100000) * 0.75
    elif 200000 < i <= 400000:
        return  100000 * 0.1 + 100000 * 0.75 + (i - 200000) * 0.5
    elif 400000 < i <= 600000:
        return  100000 * 0.1 + 100000 * 0.75 + 200000 * 0.5 + (i - 400000) * 0.3
    elif 600000 < i <= 1000000:
        return  100000 * 0.1 + 100000 * 0.75 + 200000 * 0.5 + 200000 * 0.3 +(i - 600000) * 0.15
    elif i >= 1000000:
        return  100000 * 0.1 + 100000 * 0.75 + 200000 * 0.5 + 200000 * 0.3 + 400000 * 0.15 + (i - 1000000) * 0.1

print(cal_bonus(I))